app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "taggings".* FROM "taggings" WHERE "taggings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "taggings".* FROM "taggings" WHERE "taggings"."tag_id" = ?  [["tag_id", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    @tag = Tag.find(params[:id])
    @taggins = Tagging.where(tag: @tag)
    @taggins.each(&:destroy)
    @tag.destroy